Revit 2024 API
ExternalFileReference.GetReferencingId Method
 Gets the ElementId corresponding to the element which this ExternalFileReference is associated with.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId GetReferencingId()
Visual Basic
Public Function GetReferencingId As ElementId
Visual C++
public:
ElementId^ GetReferencingId()
See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace